app/controllers/projects_controller.rb

  def create
    @project = Project.create(
      tittle: params[:project][:tittle],
      body: params[:project][:body],
    )
---
INSERT INTO "projects" ("tittle", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tittle", "Mu first project"], ["body", nil], ["user_id", 1], ["created_at", "2022-10-22 12:10:46.278134"], ["updated_at", "2022-10-22 12:10:46.278134"]]