app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]