app/controllers/users_controller.rb

  def create
    user = User.find_by(email: user_params[:email])
    if user.nil?
      user = User.new(user_params)
      if user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "artur"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "artur"], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-30 21:37:57.786995"], ["updated_at", "2022-10-30 21:37:57.786995"]]